from datetime import datetime as dt

companies = [
      {
        "id": "00000000-0000-0000-0000-000000000000",
        "full_name": "ООО ALMAX",
        "short_name": "ALMAX",
        "ogrn": "1234567890"
      }
]
departments = [
      {
        "id": "00000000-0000-0000-0000-000000000002",
        "name": "Отдел разработки",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000003",
        "name": "Отдел аналитики",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000004",
        "name": "Отдел администрирования",
        "company_id": "00000000-0000-0000-0000-000000000000"
      }
]
positions = [
      {
        "id": "00000000-0000-0000-0000-000000000005",
        "name": "Python-developer",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000006",
        "name": "DepOps-engineer",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000007",
        "name": "Frontend-developer",
        "company_id": "00000000-0000-0000-0000-000000000000"
      }
]
grades = [
      {
        "id": "00000000-0000-0000-0000-000000000008",
        "name": "Junior",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000009",
        "name": "Middle",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000010",
        "name": "Senior",
        "company_id": "00000000-0000-0000-0000-000000000000"
      }
]
users = [
      {
        "id": "00000000-0000-0000-0000-000000000001",
        "username": "admin",
        "password": "admin",
        "role_code": 1,
        "company_id": "00000000-0000-0000-0000-000000000000",
        "department_id": "00000000-0000-0000-0000-000000000004",
        "position_id": "00000000-0000-0000-0000-000000000006",
        "grade_id": "00000000-0000-0000-0000-000000000010",
        "first_name": "Иван",
        "last_name": "Иванов",
        "middle_name": "Иванович",
        "email": "vanya228@mail.ru"
      }
]
skills = [
      {
        "id": "00000000-0000-0000-0000-000000000011",
        "name": "Python",
        "normalized_name": "Python",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000012",
        "name": "Docker",
        "normalized_name": "Docker",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000013",
        "name": "JavaScript",
        "normalized_name": "Javascript",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000014",
        "name": "react",
        "normalized_name": "React",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000015",
        "name": "FastAPI",
        "normalized_name": "Fastapi",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000016",
        "name": "Celery",
        "normalized_name": "Celery",
        "company_id": "00000000-0000-0000-0000-000000000000"
      }
]
candidates = [
      {
        "id": "00000000-0000-0000-0000-000000000020",
        "position_id": "00000000-0000-0000-0000-000000000005",
        "grade_id": "00000000-0000-0000-0000-000000000009",
        "first_name": "Дмитрий",
        "last_name": "Олишевский",
        "birth_date": dt.strptime("1995-06-25", "%Y-%m-%d"),
        "min_salary": 130000,
        "adress_code": 33,
        "citizenship_code": 1,
        "family_status_code": 1,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "id": "00000000-0000-0000-0000-000000000021",
        "position_id": "00000000-0000-0000-0000-000000000005",
        "grade_id": "00000000-0000-0000-0000-000000000008",
        "first_name": "Николай",
        "last_name": "Рябко",
        "birth_date": dt.strptime("1998-01-05", "%Y-%m-%d"),
        "min_salary": 50000,
        "adress_code": 67,
        "citizenship_code": 1,
        "family_status_code": 2,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "id": "00000000-0000-0000-0000-000000000022",
        "position_id": "00000000-0000-0000-0000-000000000007",
        "grade_id": "00000000-0000-0000-0000-000000000010",
        "first_name": "Роман",
        "last_name": "Пашковский",
        "birth_date": dt.strptime("1980-10-23", "%Y-%m-%d"),
        "min_salary": 200000,
        "adress_code": 21,
        "citizenship_code": 1,
        "family_status_code": 1,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "id": "00000000-0000-0000-0000-000000000023",
        "position_id": "00000000-0000-0000-0000-000000000007",
        "grade_id": "00000000-0000-0000-0000-000000000010",
        "first_name": "Роман",
        "last_name": "Пашковский",
        "birth_date": dt.strptime("1980-10-23", "%Y-%m-%d"),
        "min_salary": 200000,
        "adress_code": 21,
        "citizenship_code": 1,
        "family_status_code": 1,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
candidate_contacts = [
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "type_code": 1,
        "value": "79781112233",
        "is_priority": False,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "type_code": 3,
        "value": "dimaol191@mail.ru",
        "is_priority": True,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "type_code": 1,
        "value": "79780912459",
        "is_priority": True,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000022",
        "type_code": 1,
        "value": "79780548901",
        "is_priority": True,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
candidate_work_places = [
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "position": "Backend Python-developer",
        "company": "Kamenolomnya",
        "work_from": dt.strptime("2015-12-11", "%Y-%m-%d"),
        "work_to": dt.strptime("2018-01-13", "%Y-%m-%d"),
        "is_actual": False,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "position": "Backend Python-developer",
        "company": "РНКБ",
        "work_from": dt.strptime("2017-09-22", "%Y-%m-%d"),
        "work_to": dt.strptime("2021-05-19", "%Y-%m-%d"),
        "is_actual": False,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "position": "Backend Python-developer",
        "company": "РНКБ",
        "work_from": dt.strptime("2021-06-09", "%Y-%m-%d"),
        "work_to": dt.strptime("2022-04-01", "%Y-%m-%d"),
        "is_actual": False,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000022",
        "position": "Frontend-developer",
        "company": "CryptoAnalitics",
        "work_from": dt.strptime("2015-03-25", "%Y-%m-%d"),
        "work_to": dt.strptime("2021-11-27", "%Y-%m-%d"),
        "is_actual": False,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000023",
        "position": "Frontend JS/React-developer",
        "company": "AVTOVAZ",
        "work_from": dt.strptime("2016-03-25", "%Y-%m-%d"),
        "work_to": dt.strptime("2023-01-13", "%Y-%m-%d"),
        "is_actual": False,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
candidate_languages = [
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "language_code": 2,
        "language_level_code": 4,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "language_code": 3,
        "language_level_code": 3,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "language_code": 2,
        "language_level_code": 6,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000022",
        "language_code": 2,
        "language_level_code": 3,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
candidate_notes = [
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "note": "Кандидат крутой, надо брать",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "note": "полюбому",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "note": "За 50к пойдет",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
candidate_skills = [
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "skill_id": "00000000-0000-0000-0000-000000000012",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "skill_id": "00000000-0000-0000-0000-000000000015",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "skill_id": "00000000-0000-0000-0000-000000000012",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "skill_id": "00000000-0000-0000-0000-000000000015",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "skill_id": "00000000-0000-0000-0000-000000000016",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000022",
        "skill_id": "00000000-0000-0000-0000-000000000013",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "candidate_id": "00000000-0000-0000-0000-000000000022",
        "skill_id": "00000000-0000-0000-0000-000000000014",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
vacancies = [
      {
        "id": "00000000-0000-0000-0000-000000000030",
        "position_id": "00000000-0000-0000-0000-000000000005",
        "department_id": "00000000-0000-0000-0000-000000000002",
        "grade_id": "00000000-0000-0000-0000-000000000009",
        "employee_count": 2,
        "priority_code": 3,
        "salary_from": 90000,
        "salary_to": 130000,
        "deadline": dt.strptime("2023-07-20", "%Y-%m-%d"),
        "adress_code": 33,
        "status_code": 2,
        "project": "GefestPRO",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "company_id": "00000000-0000-0000-0000-000000000000"
      },
      {
        "id": "00000000-0000-0000-0000-000000000031",
        "position_id": "00000000-0000-0000-0000-000000000007",
        "department_id": "00000000-0000-0000-0000-000000000002",
        "grade_id": "00000000-0000-0000-0000-000000000009",
        "employee_count": 1,
        "priority_code": 2,
        "salary_from": 80000,
        "salary_to": 150000,
        "deadline": dt.strptime("2023-10-01", "%Y-%m-%d"),
        "adress_code": 33,
        "status_code": 2,
        "project": "GefestPRO",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "company_id": "00000000-0000-0000-0000-000000000000"
      }
]
vacancy_skills = [
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000030",
        "skill_id": "00000000-0000-0000-0000-000000000011",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000030",
        "skill_id": "00000000-0000-0000-0000-000000000012",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000030",
        "skill_id": "00000000-0000-0000-0000-000000000015",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000030",
        "skill_id": "00000000-0000-0000-0000-000000000016",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000031",
        "skill_id": "00000000-0000-0000-0000-000000000013",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000031",
        "skill_id": "00000000-0000-0000-0000-000000000014",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "vacancy_id": "00000000-0000-0000-0000-000000000031",
        "skill_id": "00000000-0000-0000-0000-000000000012",
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
interviews = [
      {
        "id": "00000000-0000-0000-0000-000000000040",
        "vacancy_id": "00000000-0000-0000-0000-000000000030",
        "candidate_id": "00000000-0000-0000-0000-000000000020",
        "stage_code": 9,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "id": "00000000-0000-0000-0000-000000000041",
        "vacancy_id": "00000000-0000-0000-0000-000000000030",
        "candidate_id": "00000000-0000-0000-0000-000000000021",
        "stage_code": 8,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      },
      {
        "id": "00000000-0000-0000-0000-000000000042",
        "vacancy_id": "00000000-0000-0000-0000-000000000031",
        "candidate_id": "00000000-0000-0000-0000-000000000022",
        "stage_code": 1,
        "creator_id": "00000000-0000-0000-0000-000000000001"
      }
]
interview_stage_results = [
      {
        "interview_id": "00000000-0000-0000-0000-000000000040",
        "interview_stage_code_old": 1,
        "interview_stage_code_new": 4,
        "note": "Назначено HR-собеседование (вопрос по релокации)",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-02", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000040",
        "interview_stage_code_old": 4,
        "interview_stage_code_new": 5,
        "note": "HR-собеседование пройдено успешно, назначено тех. интервью",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-05", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000040",
        "interview_stage_code_old": 5,
        "interview_stage_code_new": 9,
        "note": "Кандидат показал неудовлетворительные результаты (отказ)",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-10", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000041",
        "interview_stage_code_old": 1,
        "interview_stage_code_new": 4,
        "note": "Назначено HR-собеседование",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-12", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000041",
        "interview_stage_code_old": 4,
        "interview_stage_code_new": 8,
        "note": "Кандидата не устраивают условия (отказ)",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-15", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000042",
        "interview_stage_code_old": 1,
        "interview_stage_code_new": 4,
        "note": "",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-17", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000042",
        "interview_stage_code_old": 4,
        "interview_stage_code_new": 5,
        "note": "hr-собес пройден успешно",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-20", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000042",
        "interview_stage_code_old": 5,
        "interview_stage_code_new": 6,
        "note": "тех собес пройден успешно",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-23", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000042",
        "interview_stage_code_old": 6,
        "interview_stage_code_new": 7,
        "note": "кандидату выслан оффер",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-04-29", "%Y-%m-%d"),
      },
      {
        "interview_id": "00000000-0000-0000-0000-000000000042",
        "interview_stage_code_old": 7,
        "interview_stage_code_new": 10,
        "note": "оффер принят",
        "creator_id": "00000000-0000-0000-0000-000000000001",
        "created_at": dt.strptime("2023-05-02", "%Y-%m-%d"),
      }
]
